### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.json"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_json(file_to_load)

In [2]:
purchase_data.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [3]:
purchase_data.describe()

              Age     Item ID       Price
count  780.000000  780.000000  780.000000
mean    22.729487   91.293590    2.931192
std      6.930604   52.707537    1.115780
min      7.000000    0.000000    1.030000
25%     19.000000   44.000000    1.960000
50%     22.000000   91.000000    2.880000
75%     25.000000  135.000000    3.910000
max     45.000000  183.000000    4.950000

## Player Count

* Display the total number of players

In [4]:
# implemented unique function to make an array with only unique SN's 
total_players = len(purchase_data['SN'].unique())
pd.DataFrame({
    "Total Players": [total_players]
})

   Total Players
0            573

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
number_unique_items = len(purchase_data['Item ID'].unique())
number_unique_items

183

In [6]:
average_price = purchase_data['Price'].mean()
average_price

2.931192307692303

In [7]:
number_of_purchases = len(purchase_data)
number_of_purchases

780

In [8]:
total_revenue = purchase_data['Price'].sum()
total_revenue

2286.33

In [9]:
# wrapped in values in brackets to represent a list
pd.DataFrame({
    "Number of Unique Items": [number_unique_items],
    "Average Price": [average_price],
    "Number of Purchases": [number_of_purchases],
    "Total Revenue": [total_revenue]
})

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       2.931192                  780        2286.33

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
# Get the count for each category
purchase_data['Gender'].value_counts()

Male                     633
Female                   136
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [12]:
# Create a dataframe unique SN's
unique_people = purchase_data.drop_duplicates(subset="SN")
len(unique_people)

573

In [13]:
# Create a dataframe with only males
males = unique_people[unique_people['Gender'] == 'Male']
# Get unique male usernames and take the length
total_males = len(males['SN'])
total_males

465

In [14]:
percent_males = total_males / total_players * 100
percent_males

81.15183246073299

In [15]:
# Create a dataframe with only females
females = unique_people[unique_people['Gender'] == 'Female']
# Get unique female usernames and take the length
total_females = len(females['SN'])
total_females

100

In [16]:
percent_females = total_females / total_players * 100
percent_females

17.452006980802793

In [17]:
# Create a dataframe with only others
other = unique_people[unique_people['Gender'] == 'Other / Non-Disclosed']
# Get unique others usernames and take the length
total_other = len(other['SN'])
total_other

8

In [18]:
percent_other = total_other / total_players * 100
percent_other

1.3961605584642234

In [19]:
# Total to ensure 100 percent
percent_females + percent_males + percent_other

100.0

In [20]:
pd.DataFrame({
    "Total Count": [total_males, total_females, total_other],
    "Percentage of Players": [percent_males, percent_females, percent_other]
}, index=["Male", "Female", "Other / Non-Disclosed"])

                       Total Count  Percentage of Players
Male                           465              81.151832
Female                         100              17.452007
Other / Non-Disclosed            8               1.396161


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [23]:
# Got lots of information using describe based off gender
gender_described = purchase_data.groupby('Gender').describe()
gender_described

                         Age                                               \
                       count       mean       std   min   25%   50%   75%
Gender
Female                 136.0  22.558824  7.419459   7.0  18.0  22.0  25.0
Male                   633.0  22.685624  6.804740   7.0  20.0  22.0  25.0
Other / Non-Disclosed   11.0  27.363636  6.932139  12.0  24.0  27.0  33.0

                            Item ID              ...                 Price  \
                        max   count        mean  ...     75%    max  count
Gender                                           ...
Female                 40.0   136.0   88.110294  ...  123.25  182.0  136.0
Male                   45.0   633.0   91.571880  ...  137.00  183.0  633.0
Other / Non-Disclosed  34.0    11.0  114.636364  ...  156.00  183.0   11.0


                           mean       std   min     25%    50%    75%   max
Gender
Female                 2.815515  1.151027  1.03  1.8275  2.615  3.750  4.95
Male                   2.950521  1.109967  1.03  2.0400  2.910  3.910  4.95
Other / Non-Disclosed  3.249091  0.957230  1.88  2.2850  3.730  3.985  4.32

[3 rows x 24 columns]

In [24]:
purchase_count_by_gender = gender_described['Price']['count']
purchase_count_by_gender

Gender
Female                   136.0
Male                     633.0
Other / Non-Disclosed     11.0
Name: count, dtype: float64

In [27]:
average_price_by_gender = gender_described['Price']['mean']
average_price_by_gender

Gender
Female                   2.815515
Male                     2.950521
Other / Non-Disclosed    3.249091
Name: mean, dtype: float64

In [26]:
total_purchase_amount_by_gender = purchase_data.groupby('Gender').sum()['Price']
total_purchase_amount_by_gender

Gender
Female                    382.91
Male                     1867.68
Other / Non-Disclosed      35.74
Name: Price, dtype: float64

## Average Purchase Total by Gender

In [28]:
total_per_gender = unique_people['Gender'].value_counts().sort_index()
total_per_gender

Female                   100
Male                     465
Other / Non-Disclosed      8
Name: Gender, dtype: int64

In [29]:
average_total_per_person = total_purchase_amount_by_gender / total_per_gender
average_total_per_person

Gender
Female                   3.829100
Male                     4.016516
Other / Non-Disclosed    4.467500
dtype: float64

In [30]:
pd.DataFrame({
    "Purchase Count": purchase_count_by_gender,
    "Average Purchase Price": average_price_by_gender,
    "Total Purchase Value": total_purchase_amount_by_gender,
    "Avg Total Purchase per Person": average_total_per_person
})

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,136.0,2.815515,382.91,3.829100
Male,633.0,2.950521,1867.68,4.016516
Other / Non-Disclosed,11.0,3.249091,35.74,4.467500

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [21]:
# Used quartiles to determine good age range for bins
purchase_data.describe()

              Age     Item ID       Price
count  780.000000  780.000000  780.000000
mean    22.729487   91.293590    2.931192
std      6.930604   52.707537    1.115780
min      7.000000    0.000000    1.030000
25%     19.000000   44.000000    1.960000
50%     22.000000   91.000000    2.880000
75%     25.000000  135.000000    3.910000
max     45.000000  183.000000    4.950000

In [32]:
age_bins = [0, 10, 15, 20, 25, 30, 35, 40, 46]
age_group_names = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '34-39', '40+']

In [33]:
# Create Groups based on the age bins, assign labels
age_groups = pd.cut(purchase_data['Age'], age_bins,labels=age_group_names)
age_groups
# Convert groups to dataframe
age_groups_binned = age_groups.to_frame()
age_groups_binned.head()

     Age
0  34-39
1  20-24
2  30-34
3  20-24
4  20-24

In [34]:
# dataframe with an age groups column
purchase_data_age_groups = purchase_data.assign(age_groups=age_groups_binned)
purchase_data_age_groups.head()

,Age,Gender,Item ID,Item Name,Price,SN,age_groups
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,34-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30-34
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24

In [35]:
# Drops all the rows that have a SN that repeats itself leaving row having a unique SN
unique_people_data = purchase_data_age_groups.drop_duplicates(subset=['SN'])
len(unique_people_data)

573

In [36]:
counts_per_age = unique_people_data['age_groups'].value_counts()
counts_per_age

20-24    234
15-19    139
10-14     54
25-29     52
30-34     44
34-39     25
<10       22
40+        3
Name: age_groups, dtype: int64

In [37]:
percent_per_age = counts_per_age / len(unique_people_data) * 100
percent_per_age

20-24    40.837696
15-19    24.258290
10-14     9.424084
25-29     9.075044
30-34     7.678883
34-39     4.363002
<10       3.839442
40+       0.523560
Name: age_groups, dtype: float64

In [38]:
pd.DataFrame({
    "Total Count": counts_per_age,
    "Percentage of Players": percent_per_age
}).sort_index()

       Total Count  Percentage of Players
10-14           54               9.424084
15-19          139              24.258290
20-24          234              40.837696
25-29           52               9.075044
30-34           44               7.678883
34-39           25               4.363002
40+              3               0.523560
<10             22               3.839442

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [39]:
purchase_data_age_groups.head()

,Age,Gender,Item ID,Item Name,Price,SN,age_groups
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,34-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30-34
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24

In [40]:
age_group_described = purchase_data_age_groups.groupby('age_groups').describe()
age_group_described

              Age                                                    Item ID  \
            count       mean       std   min   25%   50%   75%   max   count
age_groups
10-14        78.0  13.987179  1.436930  11.0  13.0  15.0  15.0  15.0    78.0
15-19       184.0  18.842391  1.464385  16.0  18.0  20.0  20.0  20.0   184.0
20-24       305.0  23.163934  1.369070  21.0  22.0  23.0  24.0  25.0   305.0
25-29        76.0  28.157895  1.470171  26.0  27.0  29.0  29.0  30.0    76.0
30-34        58.0  32.810345  1.503877  31.0  31.0  33.0  34.0  35.0    58.0
34-39        44.0  38.227273  1.492051  36.0  37.0  38.0  40.0  40.0    44.0
40+           3.0  43.333333  1.527525  42.0  42.5  43.0  44.0  45.0     3.0
<10          32.0   7.843750  1.139025   7.0   7.0   7.0   9.0  10.0    32.0

                        ...                 Price                            \
                  mean  ...     75%    max  count      mean       std   min
age_groups              ...
10-14        91.435897  ...  148.00  183.0   78.0  2.873718  1.107546  1.24
15-19        86.005435  ...  124.25  183.0  184.0  2.873587  1.138569  1.03
20-24        89.085246  ...  130.00  183.0  305.0  2.959377  1.119501  1.03
25-29        97.447368  ...  141.50  182.0   76.0  2.892368  1.115687  1.03
30-34       104.327586  ...  161.25  183.0   58.0  3.073448  1.070271  1.03
34-39       106.136364  ...  161.50  182.0   44.0  2.897500  1.107016  1.03
40+          97.000000  ...  117.00  124.0    3.0  2.880000  0.861220  2.11
<10          83.218750  ...  123.50  177.0   32.0  3.019375  1.158609  1.03


               25%    50%     75%   max
age_groups
10-14       1.9650  2.535  3.9050  4.95
15-19       1.9300  2.720  3.8125  4.95
20-24       2.0400  3.010  3.9100  4.95
25-29       1.8725  2.820  3.9225  4.95
30-34       2.0800  3.130  3.7775  4.95
34-39       2.0425  2.790  3.9075  4.62
40+         2.4150  2.720  3.2650  3.81
<10         1.9400  3.345  3.6850  4.89

[8 rows x 24 columns]

In [41]:
purchase_count_by_age_group = age_group_described['Price']['count']
average_price_by_age_group = age_group_described['Price']['mean']
total_purchase_amount_by_age_group = purchase_data_age_groups.groupby('age_groups').sum()['Price']

In [42]:
# Get count of unique people in each age group
total_per_age_group = purchase_data_age_groups.drop_duplicates(subset='SN')['age_groups'].value_counts()
average_total_per_person = total_purchase_amount_by_age_group / total_per_age_group
average_total_per_person

10-14    4.150926
15-19    3.803885
20-24    3.857308
25-29    4.227308
30-34    4.051364
34-39    5.099600
40+      2.880000
<10      4.391818
dtype: float64

In [43]:
pd.DataFrame({
    "Purchase Count": purchase_count_by_age_group,
    "Average Purchase Price": average_price_by_age_group,
    "Total Purchase Value": total_purchase_amount_by_age_group,
    "Avg Total Purchase per Person": average_total_per_person
})

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
age_groups,,,,
10-14,78.0,2.873718,224.15,4.150926
15-19,184.0,2.873587,528.74,3.803885
20-24,305.0,2.959377,902.61,3.857308
25-29,76.0,2.892368,219.82,4.227308
30-34,58.0,3.073448,178.26,4.051364
34-39,44.0,2.897500,127.49,5.099600
40+,3.0,2.880000,8.64,2.880000
<10,32.0,3.019375,96.62,4.391818

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [44]:
purchase_counts_by_sn = purchase_data.groupby('SN').count()['Item ID']
purchase_counts_by_sn.head()

SN
Adairialis76    1
Aduephos78      3
Aeduera68       3
Aela49          1
Aela59          1
Name: Item ID, dtype: int64

In [45]:
total_purchase_amount_by_sn = purchase_data.groupby('SN').sum()['Price']
total_purchase_amount_by_sn.head()

SN
Adairialis76    2.46
Aduephos78      6.70
Aeduera68       5.80
Aela49          2.46
Aela59          1.27
Name: Price, dtype: float64

In [46]:
average_price_by_sn = total_purchase_amount_by_sn / purchase_counts_by_sn
average_price_by_sn.head()

SN
Adairialis76    2.460000
Aduephos78      2.233333
Aeduera68       1.933333
Aela49          2.460000
Aela59          1.270000
dtype: float64

In [47]:
purchase_data[purchase_data['SN'] == 'Aduephos78']

     Age Gender  Item ID            Item Name  Price          SN
308   37   Male       79  Alpha, Oath of Zeal   2.88  Aduephos78
377   37   Male      174      Primitive Blade   2.46  Aduephos78
431   37   Male       92         Final Critic   1.36  Aduephos78

In [48]:
pd.DataFrame({
    "Purchase Count": purchase_counts_by_sn,
    "Average Purchase Price": average_price_by_sn,
    "Total Purchase Value": total_purchase_amount_by_sn
}).sort_values('Total Purchase Value', ascending=False).head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Undirrala66               5                3.412000                 17.06
Saedue76                  4                3.390000                 13.56
Mindimnya67               4                3.185000                 12.74
Haellysu29                3                4.243333                 12.73
Eoda93                    3                3.860000                 11.58

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [49]:
item_data = purchase_data[['Item Name', 'Item ID', 'Price']]
item_data.head()

                                   Item Name  Item ID  Price
0                Bone Crushing Silver Skewer      165   3.37
1  Stormbringer, Dark Blade of Ending Misery      119   2.32
2                            Primitive Blade      174   2.46
3                               Final Critic       92   1.36
4                             Stormfury Mace       63   1.27

In [63]:
item_purchase_count = item_data.groupby(['Item ID', 'Item Name']).count()['Price']
item_purchase_count.head()

Item ID  Item Name
0        Splinter              1
1        Crucifer              4
2        Verdict               1
3        Phantomlight          1
4        Bloodlord's Fetish    1
Name: Price, dtype: int64

In [65]:
item_price = item_data.groupby(['Item ID', 'Item Name']).mean()['Price']
item_price.head()

Item ID  Item Name
0        Splinter              1.82
1        Crucifer              2.28
2        Verdict               3.40
3        Phantomlight          1.79
4        Bloodlord's Fetish    2.28
Name: Price, dtype: float64

In [66]:
total_value = item_purchase_count * item_price
total_value.head()

Item ID  Item Name
0        Splinter              1.82
1        Crucifer              9.12
2        Verdict               3.40
3        Phantomlight          1.79
4        Bloodlord's Fetish    2.28
Name: Price, dtype: float64

In [67]:
item_summary = pd.DataFrame({
    "Purchase Count": item_purchase_count,
    "Item Price": item_price,
    "Total Purchase Value": total_value
})
item_summary.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         1        1.82                  1.82
1       Crucifer                         4        2.28                  9.12
2       Verdict                          1        3.40                  3.40
3       Phantomlight                     1        1.79                  1.79
4       Bloodlord's Fetish               1        2.28                  2.28

In [68]:
item_summary.sort_values('Purchase Count', ascending=False).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
39,"Betrayal, Whisper of Grieving Widows",11,2.35,25.85
84,Arcane Gem,11,2.23,24.53
31,Trickster,9,2.07,18.63
175,Woeful Adamantite Claymore,9,1.24,11.16
13,Serenity,9,1.49,13.41

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [69]:
item_summary.sort_values('Total Purchase Value', ascending=False).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
34,Retribution Axe,9,4.14,37.26
115,Spectral Diamond Doomblade,7,4.25,29.75
32,Orenmir,6,4.95,29.70
103,Singed Scalpel,6,4.87,29.22
107,"Splitter, Foe Of Subtlety",8,3.61,28.88